snlkuharlocal/src/Documents/ЗаявкаНаИзменениеНоменклатурнойГруппы/ЗаявкаНаИзменениеНоменклатурнойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаИзменениеНоменклатурнойГруппы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйРазмер</name>
    <type>
      <types>CatalogRef.Размеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйРазмер</name>
    <type>
      <types>CatalogRef.Размеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКоды</name>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.ШтрихКоды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прайсы</name>
    <attributes>
      <name>ПрайсЛист</name>
      <type>
        <types>DocumentRef.ПрайсЛист</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>УстановкаСкидок</name>
      <type>
        <types>DocumentRef.УстановкаСкидок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаявкаНаИзменениеНоменклатурнойГруппы/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)
	НачальнаяГруппаНоменклатуры = Неопределено;
	КонечнаяГруппаНоменклатуры = Неопределено;
	Номенклатура = Неопределено;
	Отработана = Неопределено;
	Отменена = Неопределено;
	НачальныйРазмер = Неопределено;
	КонечныйРазмер = Неопределено;
	Скидки.Очистить();
	Прайсы.Очистить();
	Комментарий = Неопределено;
	Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры
